In [1]:
import numpy as np
import pandas as pd

### .dt

In [2]:
s = pd.Series(pd.date_range("2002/01/22", "today", periods=5))
s

0   2002-01-22 00:00:00.000000000
1   2007-04-08 22:58:17.788458752
2   2012-06-23 21:56:35.576917504
3   2017-09-08 20:54:53.365376256
4   2022-11-24 19:53:11.153835008
dtype: datetime64[ns]

In [5]:
s.dt.day

0    22
1     8
2    23
3     8
4    24
dtype: int64

In [6]:
s.dt.month

0     1
1     4
2     6
3     9
4    11
dtype: int64

In [8]:
s.dt.month_name()

0      January
1        April
2         June
3    September
4     November
dtype: object

There are many other functions and attributes that you can try,<br>
This also brings nice expressions like this :

In [12]:
s[s.dt.month > 6]

3   2017-09-08 20:54:53.365376256
4   2022-11-24 19:53:11.153835008
dtype: datetime64[ns]

In [15]:
s[s.dt.month > 6].dt.month_name()

3    September
4     November
dtype: object

<br> <br>you can easily produce tz aware transformations:

In [26]:
stz  = s.dt.tz_localize("Europe/Berlin")
stz

0             2002-01-22 00:00:00+01:00
1   2007-04-08 22:58:17.788458752+02:00
2   2012-06-23 21:56:35.576917504+02:00
3   2017-09-08 20:54:53.365376256+02:00
4   2022-11-24 19:53:11.153835008+01:00
dtype: datetime64[ns, Europe/Berlin]

In [27]:
stz.dt.month_name()

0      January
1        April
2         June
3    September
4     November
dtype: object

<br> <Br>

you can also **chain** these types of operations

In [32]:
s.dt.tz_localize("Asia/Tehran").dt.tz_convert("US/Eastern")

0             2002-01-21 15:30:00-05:00
1   2007-04-08 15:28:17.788458752-04:00
2   2012-06-23 13:26:35.576917504-04:00
3   2017-09-08 12:24:53.365376256-04:00
4   2022-11-24 11:23:11.153835008-05:00
dtype: datetime64[ns, US/Eastern]

<br> <br>
you can also format datetime values as strings with **Series.dt.strftime()** which supports the same formats as the standard **strftime()** :

In [35]:
s = pd.Series(pd.date_range("2002-01-22", periods=5))
s

0   2002-01-22
1   2002-01-23
2   2002-01-24
3   2002-01-25
4   2002-01-26
dtype: datetime64[ns]

In [36]:
s.dt.strftime("%Y")

0    2002
1    2002
2    2002
3    2002
4    2002
dtype: object

In [38]:
s.dt.strftime("%Y/%M")

0    2002/00
1    2002/00
2    2002/00
3    2002/00
4    2002/00
dtype: object

<br></br>
the **dt** accessor works for periods and timedelta dtypes.

In [40]:
s = pd.Series(pd.period_range("2002/01", periods=5, freq="D"))
s

0    2002-01-01
1    2002-01-02
2    2002-01-03
3    2002-01-04
4    2002-01-05
dtype: period[D]

In [41]:
s.dt.year

0    2002
1    2002
2    2002
3    2002
4    2002
dtype: int64

<br>

In [42]:
s = pd.Series(pd.timedelta_range("1 day 00:00:02", periods=5, freq="S"))
s

0   1 days 00:00:02
1   1 days 00:00:03
2   1 days 00:00:04
3   1 days 00:00:05
4   1 days 00:00:06
dtype: timedelta64[ns]

In [43]:
s.dt.seconds

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [44]:
s.dt.components

   days  hours  minutes  seconds  milliseconds  microseconds  nanoseconds
0     1      0        0        2             0             0            0
1     1      0        0        3             0             0            0
2     1      0        0        4             0             0            0
3     1      0        0        5             0             0            0
4     1      0        0        6             0             0            0

<Br>

#### Conculusion
you can access these operations and attributes by using the **dt**

<br> <Br>

### Vectorized string methods

In [65]:
s = pd.Series(
    ["A", "B", "abcd", "hello world", np.NaN, "bazinga"],
    dtype='string'
)
s

0              A
1              B
2           abcd
3    hello world
4           <NA>
5        bazinga
dtype: string

In [66]:
s.str.contains("hello")

0    False
1    False
2    False
3     True
4     <NA>
5    False
dtype: boolean

In [67]:
s.str.lower()

0              a
1              b
2           abcd
3    hello world
4           <NA>
5        bazinga
dtype: string

In [68]:
s.str.len()

0       1
1       1
2       4
3      11
4    <NA>
5       7
dtype: Int64

In [69]:
s.str.split()

0               [A]
1               [B]
2            [abcd]
3    [hello, world]
4              <NA>
5         [bazinga]
dtype: object

In [70]:
s.str.split().str.get(0)

0          A
1          B
2       abcd
3      hello
4       <NA>
5    bazinga
dtype: object

In [71]:
s.str.split(' ', expand=True)

         0      1
0        A   <NA>
1        B   <NA>
2     abcd   <NA>
3    hello  world
4     <NA>   <NA>
5  bazinga   <NA>

Powerful pattern-matching methods are provided as well, but note that pattern-matching uses **regular expressions**